## Hacker Rank

### REGEXP or RLIKE

In [ ]:
# Pattern	What the Pattern matches
# *	Zero or more instances of string preceding it
# +	One or more instances of strings preceding it
# .	Any single character
# ?	Match zero or one instances of the strings preceding it.
# ^	caret(^) matches Beginning of string
# $	End of string
# [abc]	Any character listed between the square brackets
# [^abc]	Any character not listed between the square brackets
# [A-Z]	match any upper case letter.
# [a-z]	match any lower case letter
# [0-9]	match any digit from 0 through to 9.
# [[:<:]]	matches the beginning of words.
# [[:>:]]	matches the end of words.
# [:class:]	matches a character class i.e. [:alpha:] to match letters, [:space:] to match white space, [:punct:] is match punctuations and [:upper:] for upper class letters.
# p1|p2|p3	Alternation; matches any of the patterns p1, p2, or p3
# {n}	n instances of preceding element
# {m,n}	m through n instances of preceding element

In [ ]:
https://www.geeksforgeeks.org/mysql-regular-expressions-regexp/

In [ ]:
select * from city where countrycode='USA' and population>100000;

In [ ]:
select name from city where population>120000 and countrycode='USA';

In [ ]:
select * from city;

In [ ]:
select * from city where id=1661;

In [ ]:
select * from city where countrycode = 'JPN';

In [ ]:
select name from city where countrycode = "jpn";

In [ ]:
select city, state from station;

In [ ]:
select distinct city from station where id%2=0;

In [ ]:
select count(city) - count(distinct city) from station ;

In [ ]:
select city,length(city) from station order By length(city) asc, city asc limit 1;
select city,length(city) from station order by length(city) desc, city asc limit 1;

In [ ]:
SELECT DISTINCT(city) FROM station WHERE city RLIKE "^[aeiou]";

In [ ]:
select distinct city from station where city regexp "[aeiou]$";

In [ ]:
SELECT DISTINCT(city) FROM station WHERE city not RLIKE "^[aeiou]";

In [ ]:
SELECT DISTINCT(city) FROM station WHERE city RLIKE "^[aeiou]" and CITY RLIKE "[aeiou]$";

In [ ]:
SELECT DISTINCT(city) FROM station WHERE city not RLIKE "^[aeiou]";

In [ ]:
SELECT DISTINCT CITY FROM STATION WHERE city not RLIKE "[aeiou]$";

In [ ]:
SELECT DISTINCT(city) FROM station WHERE city not RLIKE "^[aeiou]" OR city NOT RLIKE "[aeiou]$";

In [ ]:
It could be this using the SUBSTR function in MySQL:

SELECT `name`
FROM `students`
WHERE `marks` > 75
ORDER BY SUBSTR(`name`, -3), ID ASC;
SUBSTR(name, -3) will select the last three characters in the name column of the student table.


MySQL

SELECT name FROM students WHERE marks > 75 ORDER BY SUBSTRING(name, -3, 3), id

##  SUBSTRING(string, start, length)


SELECT name FROM students WHERE marks > 75 ORDER BY (RIGHT(name, 3)), id;

In [ ]:
SELECT name FROM students WHERE marks > 75 ORDER BY RIGHT(name, 3), id;

# SQl all in one

In [ ]:
https://www.youtube.com/watch?v=wTXem0vg0Ak&list=PLtgiThe4j67rAoPmnCQmcgLS4iIc5ungg&index=3&ab_channel=TrendytechInsights

### youtube trendy tech channel playlist

In [ ]:
CRUD OPERATIONS

* CREATE - Insert Statements
* READ - Select Statements
* UPDATE - Update Statements
* DELETE - Delete Statements

In [ ]:
## Create a table and insert statements
- employee table for startup
- you prefer to hire from banglore

In [ ]:
CREATE TABLE employee (
firstname varchar(20),
middlename varchar(20),
lastname varchar(20),
age int,
salary int,
location varchar(20)
);

In [ ]:
## to see all the databases

show databases;

In [ ]:
## to drop database

drop database name_of_database;

In [ ]:
## create database

create database trendytech;

In [ ]:
# to use the database

use trendytech; # will go to trendy tech

In [ ]:
# in trendy tech see what is there in it

show tables; # shows any table with data if nothing is there it shows empty set

In [ ]:
CREATE TABLE employee (
firstname varchar(20),
middlename varchar(20),
lastname varchar(20),
age int,
salary int,
location varchar(20)
);

In [ ]:
# to get a idea about table use describe 

desc employee; # gives all data type and default type

In [ ]:
select * from employee;

# gives a glimpse of data

In [ ]:
## inserting data into the table

#Recomended way
INSERT INTO employee(firstname, middlename, lastname, age, salary, location) VALUES ('kapil', 'kumar', 'sharma', 28, 10000, 'banglore');

#normal way
INSERT INTO employee VALUES ('kapil', 'kumar', 'sharma', 28, 10000, 'banglore');

# value missing or no value to assign
INSERT INTO employee(firstname, lastname, age, salary, location) VALUES ('rajesh', 'sharma', 29, 20000, 'banglore');

# this way it will throw error value missing or no value to assign
INSERT INTO employee VALUES ('rajesh', 'sharma', 29, 20000, 'banglore');

#Recomended way for multiple values
INSERT INTO employee(firstname, middlename, lastname, age, salary, location) 
VALUES ('kapil', 'kumar', 'sharma', 28, 10000, 'banglore'), ('rajesh', 'kumar','sharma', 29, 20000, 'banglore');

In [ ]:
# first name cannot be a null value so while creating use not null

# drop table employee;

# create table with tweaked parameters

CREATE TABLE employee (
firstname varchar(20) NOT NULL, #FIRSTNAME CANNOT BE NULL
middlename varchar(20),
lastname varchar(20) NOT NULL,
age int NOT NULL,
salary int NOT NULL,
location varchar(20) NOT NULL
);

# CHECK DESCRIPTION
DESC employee;

In [ ]:
# set Default values here for location we use banglore;

# create a new table with the default values

CREATE TABLE employee (
firstname varchar(20) NOT NULL, #FIRSTNAME CANNOT BE NULL
middlename varchar(20),
lastname varchar(20) NOT NULL,
age int NOT NULL,
salary int NOT NULL,
location varchar(20) DEFAULT 'banglore'
);


# inserting new records to the table with new changes
INSERT INTO employee(firstname, lastname, age, salary, location) 
VALUES ('kapil', 'sharma', 28, 10000);


# here see the table
select * from employee;

we can see null value in middle name and location will be banglore as it is default value

# null value is still accepted in location column
INSERT INTO employee(firstname, lastname, age, salary, location) 
VALUES ('kabir', 'sharma', 28, 10000, null);

# to avoid null value and set a default we have to change the schema while creating
#drop table and create new one

# create a new table with the default values and not null

CREATE TABLE employee (
firstname varchar(20) NOT NULL, #FIRSTNAME CANNOT BE NULL
middlename varchar(20),
lastname varchar(20) NOT NULL,
age int NOT NULL,
salary int NOT NULL,
location varchar(20) NOT NULL DEFAULT 'banglore'
);

In [ ]:
### Session 3

In [ ]:
PRIMARY KEY

AUTO INCREMENT KEYS

UNIQUE KEYS

PRIMARY KEY VS UNIQUE KEY

In [ ]:
## for example in the employee table with same name and same salary how to uniquely identify them

In [ ]:
CREATE TABLE employee (
id int,
firstname varchar(20) NOT NULL, #FIRSTNAME CANNOT BE NULL
middlename varchar(20),
lastname varchar(20) NOT NULL,
age int NOT NULL,
salary int NOT NULL,
location varchar(20) NOT NULL DEFAULT 'banglore'
);


INSERT INTO employee(id, firstname, middlename, lastname, age, salary, location) 
VALUES (1, 'kapil', 'kumar', 'sharma', 28, 10000, 'banglore');

select * from employee;

# insert same details again
INSERT INTO employee(id, firstname, middlename, lastname, age, salary, location) 
VALUES (1, 'kapil', 'kumar', 'sharma', 28, 10000, 'banglore');

select * from employee;

we can see two entries with same details.


## two avoid multiple employees with same details we can use unique id so

CREATE TABLE employee (
id int PRIMARY KEY, # Primary key uniquely identifies each entry
firstname varchar(20) NOT NULL, #FIRSTNAME CANNOT BE NULL
middlename varchar(20),
lastname varchar(20) NOT NULL,
age int NOT NULL,
salary int NOT NULL,
location varchar(20) NOT NULL DEFAULT 'banglore'
);

syntax change other way for assigning primary key

CREATE TABLE employee (
id int, 
firstname varchar(20) NOT NULL, #FIRSTNAME CANNOT BE NULL
middlename varchar(20),
lastname varchar(20) NOT NULL,
age int NOT NULL,
salary int NOT NULL,
location varchar(20) NOT NULL DEFAULT 'banglore',
PRIMARY KEY(id) # Primary key uniquely identifies each entry we can assign for 2 columns in this way
);


## if we try to enter same data two times

INSERT INTO employee(id, firstname, middlename, lastname, age, salary, location) 
VALUES (1, 'kapil', 'kumar', 'sharma', 28, 10000, 'banglore');

select * from employee;
***shows result***

# insert same details again
INSERT INTO employee(id, firstname, middlename, lastname, age, salary, location) 
VALUES (1, 'kapil', 'kumar', 'sharma', 28, 10000, 'banglore');

*** result *** will show a duplicate entry for primary key

## For a primary key null is not allowed and also repeated values are not allowed

In [ ]:
# auto assigning id value with auto increment

CREATE TABLE employee (
id int AUTO_INCREMENT, # AUTO INCREMENT
firstname varchar(20) NOT NULL, #FIRSTNAME CANNOT BE NULL
middlename varchar(20),
lastname varchar(20) NOT NULL,
age int NOT NULL,
salary int NOT NULL,
location varchar(20) NOT NULL DEFAULT 'banglore',
PRIMARY KEY(id) # Primary key uniquely identifies each entry we can assign for 2 columns in this way
);

# insert details NO NEED FOR GIVING ID AS IT IS AUTOMATICALLY ASSIGNED
INSERT INTO employee(firstname, middlename, lastname, age, salary, location) 
VALUES ('kapil', 'kumar', 'sharma', 28, 10000, 'banglore');

### 
- we can have only one primary key
- the primary key cannot hold any null 
- we should use primary key when we have to uniquely identify each record.
- unique key can hold NULL
- in mysql  a unique key can hold any number of null values.

- in some of the other famous DBs unique key hold only one null
- so the purpose of the unique key is to make sure the values do not duplicate. (for example mail id's cannot be same)
- we can have only one primary key but multiple unique keys in a table.

In [ ]:
CREATE TABLE employee (
firstname varchar(20) NOT NULL,
lastname varchar(20) NOT NULL,
age int NOT NULL,
PRIMARY KEY(firstname, lastname) # Primary key uniquely identifies each entry here combination should be unique
);

In [ ]:
CREATE TABLE employee (
firstname varchar(20) NOT NULL,
lastname varchar(20) NOT NULL,
age int NOT NULL,
UNIQUE KEY(firstname, lastname) #uniquely identifies each entry here combination should be unique
);

In [ ]:
### Session 4

In [ ]:
show databases;

# shows all databases

# drop database database_name;

In [ ]:
# create database;

create database trendytech;

#use the database

use trendytech;


CREATE TABLE employee (
id int PRIMARY KEY, # Primary key uniquely identifies each entry
firstname varchar(20) NOT NULL, #FIRSTNAME CANNOT BE NULL
middlename varchar(20),
lastname varchar(20) NOT NULL,
age int NOT NULL,
salary int NOT NULL,
location varchar(20) NOT NULL DEFAULT 'banglore'
);

desc employee; # description will be shown

INSERT INTO employee(id, firstname, lastname, age, salary, location) 
VALUES (1, 'kapil', 'sharma', 28, 10000, 'banglore');

INSERT INTO employee(id, firstname, lastname, age, salary, location) 
VALUES (2, 'akil', 'swarma', 27, 12000, 'banglore');


INSERT INTO employee(id, firstname, lastname, age, salary, location) 
VALUES (2, 'lela', 'sheik', 32, 22000, 'banglore');


select * from employee;
# gives full data

select firstname, lastname from employee;
#gives 2 columns firstname and lastname

select * from employee where age>29;
#gives based on where filter

select * from employee where firstname = 'AKHIL';
# it gives the result as here it is case insesitive.

## if we want to search for a case sensitive thing we can use
select * from employee where binary firstname='akhil';
** this is case sensitive


## alias name
select firstname as name, lastname as surname from employee;
# output column names are name and surname

In [ ]:
## update 

update employee set lastname='sinha' where firstname='akil';

select * from employee;

** result ** will have akil sinha

-----------

update employee set location='hyderabad' where firstname='akil';

select * from employee;
** result** location is updated for akil

-----------

update employee set location='hyderabad';

** result all employees location changed to hyderabad***

-----------

### increase salary of all employees by 5000

update employee set salary = salary + 5000;

** result all employees salary will be increased** 

-----------

update will update data permanently

In [ ]:
## Delete

delete from employee where id = 3;

select * from employee;
** result** 

-----------
delte from employee;
** result delete whole data of employee**

In [ ]:
## alter command 
- alter is used to alter the structure of the table.

## add a column
alter table employee add column jobtitle varchar(50);

select * from table;
**result** with a new column

## drop column
alter table employee drop column jobtitle;

select * from employee;
** result ** column is dropped

-----------

## modify column

for example the length of firstname where we gave varchar as 20 but we want to increase now

alter table employee modify column firstname varchar(35);

desc employee;
** result ** updated varchar for firstname

-----------

## modify column type like key

alter table employee drop primary key;

desc employee;
** result primary key dropped**

## modify column type like key

alter table employee add primary key(age); # age column is primary key now

desc employee;
** result primary key is added to age column**

In [ ]:
## DDL VS DML

Data Definition Language - deals with table structure

create, alter , drop - DDL Commands

-----------

Data Manipulation Language - here we deal with the data directly.

insert, update, delete - DML commands


# Truncate
truncate table employee;


truncate also removes all records like delte

but truncate is DDL Command this is structure related.

## Delete vs Truncate
Delete individually drops the table
Truncate internally drops the table and recreates it. (this is better when we are having billions of data points)
truncate more efficient for large data.

In [ ]:
session 5
=========

In [ ]:
students Table # a student table for a training centre
==============

FOREIGN KEY CONSTRAINT

student_id
student_fname
student_lname
student_mname
student_email
student_phone
student_alternate_phone
enrollment_date
years_of_exp
student_company
batch_date
source_of_joining
location

In [ ]:
create database trendytech;

use trendytech;

create table students (
student_id int AUTO_INCREMENT,
student_fname varchar(30) NOT NULL,
student_lname varchar(30) NOT NULL,
student_mname varchar(30),
student_email varchar(30) NOT NULL,
student_phone varchar(15) NOT NULL,
student_alternate_phone varchar(15) NOT NULL,
enrollment_date TIMESTAMP NOT NULL,
years_of_exp INT NOT NULL,
student_company varchar(30),
batch_date varchar(30) NOT NULL
source_of_joining varchar(30) NOT NULL
location varchar(30) NOT NULL
primary key (student_id),
unique key(student_email)
);


desc students;

In [ ]:
seed data
=========

insert into students (student_fname, student_lname, student_email, student_phone, years_of_exp,
student_company, batch_date, source_of_joining) values ('rohit', 'sharma', 'rohit@gmail.com', '9191919191', 
6, 'walmart', '5-02-2023', 'linkedin', 'banglore');

insert into students (student_fname, student_lname, student_email, student_phone, years_of_exp,
student_company, batch_date, source_of_joining) values ('virat', 'kohli', 'virat@gmail.com', '9292929292', 
3, 'flipkart', '5-02-2023', 'linkedin', 'hyderabad');

insert into students (student_fname, student_lname, student_email, student_phone, years_of_exp,
student_company, batch_date, source_of_joining) values ('shikar', 'dhawan', 'shikarr@gmail.com', '9393939393', 
12,  '19-02-2023', 'google', 'banglore');

insert into students (student_fname, student_lname, student_email, student_phone, years_of_exp,
student_company, batch_date, source_of_joining) values ('rahul', 'dravid', 'rahul@gmail.com', '9494949494', 
8, 'walmart', '19-02-2023', 'quora', 'chennai');

In [ ]:
to get a clean view 

select student_id, enrollment_date, student_fname, student_email, years_of_exp, student_company, batch_date, 
source_of_joining, location from students;

** time is in ust ***

In [ ]:
create table courses(
course_id int NOT NULL,
course_name varchar(30) NOT NULL,
course_duration_months int NOT NULL,
course_fee int NOT NULL,
PRIMARY KEY(course_id)
);

In [ ]:
seed data
=========

insert into  coursed values(1, 'bigdata', 6, 50000);

insert into  coursed values(2, 'web development', 3, 20000);

insert into  coursed values(3, 'data science', 6, 40000);

insert into  coursed values(4, 'devops', 1, 10000);

In [ ]:
drop table students;

## recreate it with a new column selected course

In [ ]:
create table students (
student_id int AUTO_INCREMENT,
student_fname varchar(30) NOT NULL,
student_lname varchar(30) NOT NULL,
student_mname varchar(30),
student_email varchar(30) NOT NULL,
student_phone varchar(15) NOT NULL,
student_alternate_phone varchar(15) NOT NULL,
enrollment_date TIMESTAMP NOT NULL,
selected_course int NOT NULL DEFAULT 1, # ADDED A NEW COLUMN OF COURSE
years_of_exp INT NOT NULL,
student_company varchar(30),
batch_date varchar(30) NOT NULL
source_of_joining varchar(30) NOT NULL
location varchar(30) NOT NULL
primary key (student_id),
unique key(student_email)
);

In [ ]:
seed data
=========

insert into students (student_fname, student_lname, student_email, student_phone, selected_course, years_of_exp,
student_company, batch_date, source_of_joining) values ('rohit', 'sharma', 'rohit@gmail.com', '9191919191', 2,
6, 'walmart', '5-02-2023', 'linkedin', 'banglore');

insert into students (student_fname, student_lname, student_email, student_phone, years_of_exp,
student_company, batch_date, source_of_joining) values ('virat', 'kohli', 'virat@gmail.com', '9292929292', 
3, 'flipkart', '5-02-2023', 'linkedin', 'hyderabad');

insert into students (student_fname, student_lname, student_email, student_phone, selected_course, years_of_exp,
student_company, batch_date, source_of_joining) values ('shikar', 'dhawan', 'shikarr@gmail.com', '9393939393', 3,
12,  '19-02-2023', 'google', 'banglore');

insert into students (student_fname, student_lname, student_email, student_phone, years_of_exp,
student_company, batch_date, source_of_joining) values ('jaspreet', 'bumrah', 'jaspreet@gmail.com', '9595959595', 5,
13, 'walmart', '19-02-2023', 'quora', 'chennai');

## bumrah selected a course with course id 5 but that id does not exist in system

drop table student; #for the above issue to be addressed

In [ ]:
create table students (
student_id int AUTO_INCREMENT,
student_fname varchar(30) NOT NULL,
student_lname varchar(30) NOT NULL,
student_mname varchar(30),
student_email varchar(30) NOT NULL,
student_phone varchar(15) NOT NULL,
student_alternate_phone varchar(15) NOT NULL,
enrollment_date TIMESTAMP NOT NULL,
selected_course int NOT NULL DEFAULT 1, # ADDED A NEW COLUMN OF COURSE
years_of_exp INT NOT NULL,
student_company varchar(30),
batch_date varchar(30) NOT NULL
source_of_joining varchar(30) NOT NULL
location varchar(30) NOT NULL
primary key (student_id),
unique key(student_email)
FOREIGN KEY (selected_course) REFERENCES coursed(course_id)
);


=======
parent - courses
child - students

======

desc students;

In [ ]:
seeddata
=======


insert into students (student_fname, student_lname, student_email, student_phone, selected_course, years_of_exp,
student_company, batch_date, source_of_joining) values ('rohit', 'sharma', 'rohit@gmail.com', '9191919191', 2,
6, 'walmart', '5-02-2023', 'linkedin', 'banglore');

insert into students (student_fname, student_lname, student_email, student_phone, years_of_exp,
student_company, batch_date, source_of_joining) values ('virat', 'kohli', 'virat@gmail.com', '9292929292', 
3, 'flipkart', '5-02-2023', 'linkedin', 'hyderabad');

insert into students (student_fname, student_lname, student_email, student_phone, selected_course, years_of_exp,
student_company, batch_date, source_of_joining) values ('shikar', 'dhawan', 'shikarr@gmail.com', '9393939393', 3,
12,  '19-02-2023', 'google', 'banglore');

In [ ]:
insert into students (student_fname, student_lname, student_email, student_phone, years_of_exp,
student_company, batch_date, source_of_joining) values ('jaspreet', 'bumrah', 'jaspreet@gmail.com', '9595959595', 5,
13, 'walmart', '19-02-2023', 'quora', 'chennai');


### this we cannot add or update a child row throws error foreign key constraintsa fails

In [ ]:
let say if we try to delete a course web development

delete from coursed where course_id = 2;

this will throw error because there is some student who is taking this course and if we delte this it will become invalid

In [ ]:
let say if we try to delete a course devops

delete from coursed where course_id = 4;

no error here it gets executed as there is no student in the student table 
who is taking devops course so no constraint for foreign key

In [ ]:
#### foreign key

- the foreign key constraint is used to prevent actions that would destroy links between two tables
- A foreign key is a field in one table that refers to the primary key in another table.
- selected_course is a foreign key in students table which refers to course_id (primarykey) in courses table.

the table with the foreign key is called the child table,
the table with the primary key is called the parent or referenced table.

In [ ]:
NOT NULL
UNIQUE KEY
PRIMARY KEY
FOREIGN KEY
CHECK CONSTRAINT (noat supported in mysql)


Constraints are used to limit the type of data that can go into a table.

This ensures the accuracy and reliability of the data is maintained.

if there is any violation then the action is aborted.

In [ ]:
Session 6
=========

In [ ]:
DISTINCT

ORDER BY

LIMIT

LIKE

In [ ]:
Distinct
========

we have tables student table and courses table from our previous session

In [ ]:
show tables; #shows all the tables in database

# find from which cities all the students who joined in the course from our tables

select location from students;

# this gives even repeated locations each student location is generated from the above command


select distinct location from students;


select distinct student_company from students;
## all companies list we will get

#source of joining 
select distinct source_of_joining from students;

In [ ]:
Order by
========

In [ ]:
# we want the students list based on the years of experience
select student_fname from students order by years_of_experience; # by defauly it is ascending order

select student_fname from students order by student_fname;
#alphabetical order of student_fname

select student_fname from students order by years_of_experience desc;
# this is descending order

# if same ecperience for 2 students order by other param
select student_fname, years_of_experience from students order by years_of_exp, student_fname;

In [ ]:
limit
=====

In [ ]:
select * from students limit 3;
# this is giving 3 records but we dont know on what params

# get 3 candidates with least experience
select * from students order by years_of_exp limit 3;

# get 3 candidates with highest experience
select * from students order by years_of_exp desc limit 3;


# find last 5 candidates from which sources they have enrolled
select source_of_joining from students order by enrollment_date desc limit 5;

# find distinct last 5 candidates from which sources they have enrolled
select distinct sourcr_of_joining from students order by enrollment_date desc limit 5;
** willl throw an error here**


select * from students order by years_of_exp limit 0,3;
# here limit 0,3 means starting from 0th row give 3 records


select * from students order by years_of_exp limit 3,2;
# here limit 2,3 means starting from 2nd row give 3 records

In [ ]:
like
====

In [ ]:
select * from students where  studentJ_fname LIKE '%ra';
# this gives all the student names that ends with ra

# #  % is a wildcard character this tells in place of it can have any num of characters

select * from students where  studentJ_fname LIKE 'ra%';
# this gives all the student names that starts with ra

select * from students where  studentJ_fname LIKE '%at';
# this gives all the student names that ends with at


## let say we need all students whose first name is having only 5 characters
select * from students where  studentJ_fname LIKE '_____';

# _ underscore is also a wildcard character it says in place of it it can have any one character
# only one character for one underscore


select * from students where  studentJ_fname LIKE '%\_at';
# this gives all the student names that ends with _at ends with underscore a t
# backslash is used as escape character